import 'package:mulabbi/models/adhkar_model.dart';

final Map<String, List<ContentItem>> adhkarData = {
  "اذكار الصباح": [
    ContentItem(
      text:
          "اللّهُمَّ بِكَ أَصْبَحْنا وَبِكَ أَمْسَيْنا، وَبِكَ نَحْيا وَبِكَ نَمُوتُ وَإِلَيْكَ النُّشُور.",
      repeat: "مرة واحدة",
    ),
    ContentItem(
      text:
          "اللّهُمَّ بِكَ أَصْبَحْنا وَبِكَ أَمْسَيْنا، وَبِكَ نَحْيا وَبِكَ نَمُوتُ وَإِلَيْكَ النُّشُور.",
      repeat: "مرة واحدة",
    ),
    ContentItem(
      text:
          "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ. رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذَا الْيَوْمِ، وَخَيْرَ مَا بَعْدَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذَا الْيَوْمِ، وَشَرِّ مَا بَعْدَهُ. رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ، وَسُوءِ الْكِبَرِ. رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ، وَعَذَابٍ فِي الْقَبْرِ.",
      repeat: "مرة واحدة",
    ),
    ContentItem(
      text:
          "اللَّهُمَّ إِنِّي أَصْبَحْتُ أُشْهِدُكَ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلَائِكَتَكَ، وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ، لَا إِلَهَ إِلَّا أَنْتَ، وَحْدَكَ لَا شَرِيكَ لَكَ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ.",
      repeat: "ثلاث مرات",
    ),
  ],
  "اذكار المساء": [
    ContentItem(
      text:
          "اللّهُمَّ أَمْسَيْنا وَأَمْسَى المُلْكُ لِلّهِ وَالحَمْدُ لِلّهِ، لا إِلَهَ إِلّا اللّهُ وَحْدَهُ لا شَرِيكَ لَهُ.",
      repeat: "مرة واحدة",
    ),
    ContentItem(
      text: "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ.",
      repeat: "ثلاث مرات",
    ),
    ContentItem(
      text:
          "اللّهُمَّ إِنِّي أَمْسَيْتُ أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ وَمَلَائِكَتَكَ وَجَمِيعَ خَلْقِكَ أَنَّكَ أَنْتَ اللّهُ لَا إِلَهَ إِلَّا أَنْتَ وَحْدَكَ لَا شَرِيكَ لَكَ وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ.",
      repeat: "ثلاث مرات",
    ),
    ContentItem(
      text:
          "اللّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ هَذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا.",
      repeat: "مرة واحدة",
    ),
  ],
  "اذكار قبل النوم": [
    ContentItem(
      text: "بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا.",
      repeat: "مرة واحدة",
    ),
    ContentItem(
      text: "اللّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ.",
      repeat: "مرة واحدة",
    ),
    ContentItem(
      text:
          "اللّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ.",
      repeat: "مرة واحدة",
    ),
    ContentItem(
      text:
          "اللّهُمَّ اغْفِرْ لِي ذُنُوبِي وَاجْعَلْ لِي فِي قَلْبِي نُورًا وَفِي سَمْعِي نُورًا وَفِي بَصَرِي نُورًا.",
      repeat: "مرة واحدة",
    ),
  ],
  "اذكار الحج والعمرة": [
    ContentItem(
      text:
          "لَبَّيْكَ اللَّهُمَّ لَبَّيْك، لَبَّيْكَ لاَ شَرِيكَ لَكَ لَبَّيْك، إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ، لاَ شَرِيكَ لَكَ.",
      repeat: "دائمة أثناء النسك",
    ),
    ContentItem(
      text:
          "اللّهُمَّ اجْعَلْ حَجِّي مَبْرُورًا وَسَعْيِي مَشْكُورًا وَذَنْبِي مَغْفُورًا.",
      repeat: "بعد كل طواف",
    ),
  ],
  "اذكار الصلاة": [
    ContentItem(
      text: "أَسْتَغْفِرُ اللَّهَ، أَسْتَغْفِرُ اللَّهَ، أَسْتَغْفِرُ اللَّهَ.",
      repeat: "ثلاث مرات بعد الصلاة",
    ),
    ContentItem(
      text:
          "اللَّهُمَّ أَنْتَ السَّلاَمُ وَمِنْكَ السَّلاَمُ، تَبَارَكْتَ يَا ذَا الْجَلالِ وَالإِكْرَامِ.",
      repeat: "مرة واحدة بعد الصلاة",
    ),
  ],
  "اذكار التشهد": [
    ContentItem(
      text:
          "التَّحِيَّاتُ لِلَّهِ، وَالصَّلَوَاتُ، وَالطَّيِّبَاتُ، السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ، السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ.",
      repeat: "في كل صلاة",
    ),
    ContentItem(
      text:
          "اللّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ.",
      repeat: "في كل صلاة",
    ),
  ],
};
