import 'package:mulabbi/models/dua_model.dart';

final Map<String, List<ContentItem>> duasData = {
  "دعاء السفر": [
    ContentItem(
      title: "دعاء الركوب والسفر",
      text:
          "اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ، وَإِنَّا إِلَى رَبِّنَا لَمُنقَلِبُونَ.",
    ),
    ContentItem(
      title: "دعاء السفر",
      text:
          "اللَّهُمَّ إِنِّي أَسْأَلُكَ فِي سَفَرِي هَذَا الْبِرَّ وَالتَّقْوَى، وَمِنَ الْعَمَلِ مَا تَرْضَى، اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا، وَاطْوِ عَنَّا بُعْدَهُ.",
    ),
  ],
  "ادعية الحج": [
    ContentItem(
      title: "دعاء نية الإحرام",
      text:
          "اللهم إني أُريد العمرة (أو الحج أو الاثنين معًا) فيسرها لي وتقبلها مني فإن حبسني حابس فمحلي حيث حبستني.",
    ),
    ContentItem(
      title: "دعاء بعد الإحرام",
      text:
          "اللهم اجعله حجاً مبروراً وسعياً مشكوراً وذنباً مغفورا وعملا صالحا مقبولا وتجارة لن تبور",
    ),
    ContentItem(
      title: "دعاء الطواف",
      text:
          "بسم الله، والله أكبر. اللهم إيماناً بك وتصديقاً بكتابك ووفاء بعهدك واتباعاً لسنة نبيك محمد ﷺ.",
    ),
  ],
  "ادعية العمرة": [
    ContentItem(
      title: "دعاء نية العمرة",
      text: "اللهم إني نويت العمرة فيسرها لي وتقبلها مني.",
    ),
    ContentItem(
      title: "دعاء السعي بين الصفا والمروة",
      text: "رب اغفر وارحم وتجاوز عما تعلم، إنك أنت الأعز الأكرم.",
    ),
  ],
  "ادعية للوالدين": [
    ContentItem(
      title: "دعاء للوالدين",
      text: "رَبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا.",
    ),
    ContentItem(
      title: "دعاء آخر",
      text:
          "اللهم اجز والديّ عني خير الجزاء، واغفر لهما، وارزقهما الفردوس الأعلى.",
    ),
  ],
  "ادعية للميت": [
    ContentItem(
      title: "دعاء للميت",
      text: "اللهم اغفر له، وارحمه، وعافه، واعف عنه، وأكرم نزله، ووسع مدخله.",
    ),
    ContentItem(
      title: "دعاء عند القبر",
      text: "اللهم لا تحرمنا أجره، ولا تفتنا بعده، واغفر لنا وله.",
    ),
  ],
};
